def додавання(x, y):
    """
    Функція для додавання двох чисел.

    >>> додавання(2, 3)
    5
    >>> додавання(-1, 1)
    0
    >>> додавання(0, 0)
    0
    """
    return x + y


def віднімання(x, y):
    """
    Функція для віднімання двох чисел.

    >>> віднімання(5, 3)
    2
    >>> віднімання(-1, 1)
    -2
    >>> віднімання(0, 0)
    0
    """
    return x - y


def множення(x, y):
    """
    Функція для множення двох чисел.

    >>> множення(2, 3)
    6
    >>> множення(-1, 1)
    -1
    >>> множення(0, 5)
    0
    """
    return x * y


def ділення(x, y):
    """
    Функція для ділення двох чисел.

    >>> ділення(6, 3)
    2.0
    >>> ділення(5, 2)
    2.5
    >>> ділення(1, 0)
    'Помилка: Ділення на нуль'
    """
    if y != 0:
        return x / y
    else:
        return "Помилка: Ділення на нуль"


if __name__ == "__main__":
    import doctest

    doctest.testmod()

print("Оберіть операцію:")
print("1. Додавання")
print("2. Віднімання")
print("3. Множення")
print("4. Ділення")

операція = input("Введіть номер операції (1/2/3/4): ")

число1 = float(input("Введіть перше число: "))
число2 = float(input("Введіть друге число: "))

if операція == "1":
    print(число1, "+", число2, "=", додавання(число1, число2))
elif операція == "2":
    print(число1, "-", число2, "=", віднімання(число1, число2))
elif операція == "3":
    print(число1, "*", число2, "=", множення(число1, число2))
elif операція == "4":
    print(число1, "/", число2, "=", ділення(число1, число2))
else:
    print("Невірний вибір операції")
