def додавання(x, y):
    return x + y


def віднімання(x, y):
    return x - y


def множення(x, y):
    return x * y


def ділення(x, y):
    if y != 0:
        return x / y
    else:
        return "Помилка: Ділення на нуль"


print("Оберіть операцію:")
print("1. Додавання")
print("2. Віднімання")
print("3. Множення")
print("4. Ділення")

операція = input("Введіть номер операції (1/2/3/4): ")

число1 = float(input("Введіть перше число: "))
число2 = float(input("Введіть друге число: "))

if операція == "1":
    print(число1, "+", число2, "=", додавання(число1, число2))
elif операція == "2":
    print(число1, "-", число2, "=", віднімання(число1, число2))
elif операція == "3":
    print(число1, "*", число2, "=", множення(число1, число2))
elif операція == "4":
    print(число1, "/", число2, "=", ділення(число1, число2))
else:
    print("Невірний вибір операції")
